# підключаємо бібліотеку комп'ютерного зору OpenCV
import cv2


# функція для розпізнавання облич на кадрі
def highlightFace(net, frame, conf_threshold=0.7):
    # копіюємо кадр для обробки
    frameOpencvDnn = frame.copy()
    # отримуємо висоту і ширину кадру
    frameHeight = frameOpencvDnn.shape[0]
    frameWidth = frameOpencvDnn.shape[1]
    # створюємо об'єкт для нейронної мережі з кадру, розміром 300х300, і віднімаємо середні значення для кожного каналу
    blob = cv2.dnn.blobFromImage(
        frameOpencvDnn, 1.0, (300, 300), [104, 117, 123], True, False
    )
    # подаємо кадр на вхід нейронної мережі
    net.setInput(blob)
    # виконуємо розпізнавання і отримуємо результат
    detections = net.forward()
    # змінна для рамок навколо обличчя
    faceBoxes = []
    # перебираємо всі блоки після розпізнавання
    for i in range(detections.shape[2]):
        # отримуємо результат для поточного блоку
        confidence = detections[0, 0, i, 2]
        # якщо результат більший за поріг довіри - вважаємо, що обличчя розпізнано
        if confidence > conf_threshold:
            # отримуємо координати рамки навколо обличчя, перетворюючи їх з відносних до абсолютних
            x1 = int(detections[0, 0, i, 3] * frameWidth)
            y1 = int(detections[0, 0, i, 4] * frameHeight)
            x2 = int(detections[0, 0, i, 5] * frameWidth)
            y2 = int(detections[0, 0, i, 6] * frameHeight)
            # додаємо координати рамки до списку
            faceBoxes.append([x1, y1, x2, y2])
            # малюємо рамку навколо обличчя на кадрі
            cv2.rectangle(
                frameOpencvDnn,
                (x1, y1),
                (x2, y2),
                (0, 255, 0),
                int(round(frameHeight / 150)),
                8,
            )
    # повертаємо оброблений кадр і список координат рамок навколо обличчя
    return frameOpencvDnn, faceBoxes


# завантажуємо конфігурацію для нейронної мережі — опис шарів і зв'язків нейронів
faceProto = "opencv_face_detector.pbtxt"
# завантажуємо ваги для нейронної мережі — числові значення, які визначають силу зв'язків між нейронами
faceModel = "opencv_face_detector_uint8.pb"

# створюємо об'єкт для нейронної мережі, завантажуючи конфігурацію і ваги
faceNet = cv2.dnn.readNet(faceModel, faceProto)

# відкриваємо відеопотік з камери (0 - це індекс камери, зазвичай це вбудована камера ноутбука)
video = cv2.VideoCapture(0)
# нескінченний цикл для обробки відеопотоку до тих пір, поки користувач не натисне клавішу
while cv2.waitKey(1) < 0:
    # отримуємо кадр з відеопотоку
    hasFrame, frame = video.read() 
    # якщо кадр не отримано (наприклад, відеопотік закінчився або камера не працює)
    if not hasFrame:
        # виводимо в консолі, що відеопотік не отримано
        print("Відеопотік не отримано")
        cv2.waitKey()
        break

    # дзеркальне відображення (горизонтальний переворот) кадру (опціонально, залежно від того, як ви хочете відображати відео)
    # frame = cv2.flip(frame, 1)

    # розпізнаємо обличчя на кадрі і отримуємо оброблений кадр і список координат рамок навколо обличчя
    resultImg, faceBoxes = highlightFace(faceNet, frame)
    # якщо обличчя не знайдено
    if not faceBoxes:
        # виводимо в консолі, що обличчя не розпізнано
        print("Обличчя не розпізнано")
        
    # дзеркально інвертуємо вже оброблений кадр перед показом (опціонально) - це може бути корисно, якщо ви хочете, щоб відео виглядало як у дзеркалі
    resultImg = cv2.flip(resultImg, 1)

    # відображаємо оброблений кадр з рамками навколо обличчя в окремому вікні
    cv2.imshow("Face detection", resultImg)
# після завершення циклу закриваємо відеопотік і всі вікна
video.release()
cv2.destroyAllWindows()
